SecurityEvent
| where Activity == "4657 - A registry value was modified."
| where ObjectName == "\\REGISTRY\\MACHINE\\SYSTEM\\ControlSet001\\Control\\SecurityProviders\\WDigest"
| where ObjectValueName contains "UseLogonCredential"
| where NewValue == "1"
